{
  "best_epoch": 4,
  "no_components": 64,
  "loss": "warp",
  "learning_rate": 0.05,
  "item_alpha": 1e-05,
  "user_alpha": 1e-05,
  "best_test_auc": 0.3834,
  "train_auc": 0.5679,
  "precision_at_10": 0.01666666753590107,
  "recall_at_10": 0.08333333333333333,
  "item_features": [
    "category",
    "brand",
    "price_range",
    "rating_band"
  ],
  "user_features": [
    "gender",
    "tenure_band",
    "age_group",
    "interests"
  ],
  "weight_map": {
    "view": 1,
    "wishlist": 2,
    "cart": 3,
    "purchase": 5
  }
}